{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"node": [{"name": "swa_model/value_output/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/add_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/v3/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}, {"size": "3"}]}}}}}, {"name": "swa_model/v2/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/v2/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/policy_output/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/sub_25/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_18/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Reshape_14/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Sum_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/strided_slice_4/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/strided_slice_4/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/strided_slice_4/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "swa_model/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/add", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "22"}, {"size": "22"}]}}}}}, {"name": "swa_model/Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/strided_slice_11/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/strided_slice_11/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/strided_slice_11/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/symmetries", "op": "Placeholder", "attr": {"dtype": {"type": "DT_BOOL"}, "shape": {"shape": {"dim": [{"size": "3"}]}}}}, {"name": "swa_model/strided_slice_9/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/bin_inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "49"}, {"size": "22"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/truediv_4_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_34/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "swa_model/Tensordot_4/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/v1/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Reshape_4/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "swa_model/Tensordot_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "14"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_4/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/global_inputs", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "14"}]}}}}, {"name": "swa_model/PadV2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "14"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/conv1/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "22"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv1/w2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv1/w1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_3/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_3/Switch_3-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "ConstantFolding/swa_model/cond_4/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_4/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv2/w2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv2/w1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_5/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_5/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_6/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_6/Switch_3-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "swa_model/rconv3/w2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_2/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/concat_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/rconv3/w1b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_7/Switch_4-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "ConstantFolding/swa_model/cond_7/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_8/Switch_4-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "ConstantFolding/swa_model/cond_8/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Reshape_10/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_2/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv3/w1a", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_9/Switch_4-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "ConstantFolding/swa_model/cond_9/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv4/w2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv4/w1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_10/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_10/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_11/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_11/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv5/w2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv5/w1b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_12/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_12/Switch_3-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "ConstantFolding/swa_model/cond_13/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_13/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_3/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv5/w1a", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_14/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_14/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv6/w2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv6/w1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_15/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_15/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_16/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_16/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_17/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_17/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_23/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_23/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Reshape_12/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "swa_model/Tensordot_5/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/g1/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_18/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_18/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Reshape_11/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/sub_20/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/mul_26/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/p2/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_4/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_4/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "32"}]}}}}}, {"name": "swa_model/p1/intermediate_conv/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_19/Switch_4-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/cond_19/Switch_3-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/ownership_output/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/vownership/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/miscvalues_output/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/mv3/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/mv3/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/strided_slice_11", "op": "StridedSlice", "input": ["swa_model/symmetries", "swa_model/strided_slice_11/stack", "swa_model/strided_slice_11/stack_1", "swa_model/strided_slice_11/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_BOOL"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "swa_model/strided_slice_10", "op": "StridedSlice", "input": ["swa_model/symmetries", "swa_model/strided_slice_11/stack_2", "swa_model/strided_slice_11/stack", "swa_model/strided_slice_11/stack_2"], "attr": {"T": {"type": "DT_BOOL"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "swa_model/strided_slice_9", "op": "StridedSlice", "input": ["swa_model/symmetries", "swa_model/strided_slice_9/stack", "swa_model/strided_slice_11/stack_2", "swa_model/strided_slice_11/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "swa_model/Reshape", "op": "Reshape", "input": ["swa_model/bin_inputs", "swa_model/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "swa_model/mul", "op": "Mul", "input": ["swa_model/PadV2", "swa_model/global_inputs"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_24/Switch", "op": "Switch", "input": ["swa_model/strided_slice_11", "swa_model/strided_slice_11"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_26/Switch", "op": "Switch", "input": ["swa_model/strided_slice_10", "swa_model/strided_slice_10"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_25/Switch", "op": "Switch", "input": ["swa_model/strided_slice_9", "swa_model/strided_slice_9"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond/Switch_1", "op": "Switch", "input": ["swa_model/Reshape", "swa_model/strided_slice_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_1/Shape", "op": "Shape", "input": ["swa_model/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "swa_model/cond_24/switch_t", "op": "Identity", "input": ["swa_model/cond_24/Switch:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_26/switch_t", "op": "Identity", "input": ["swa_model/cond_26/Switch:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_25/switch_t", "op": "Identity", "input": ["swa_model/cond_25/Switch:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/Tensordot_1/GatherV2_1", "op": "GatherV2", "input": ["swa_model/Tensordot_1/Shape", "swa_model/strided_slice_11/stack_2", "swa_model/Tensordot_4/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_1/GatherV2", "op": "GatherV2", "input": ["swa_model/Tensordot_1/Shape", "swa_model/strided_slice_9/stack", "swa_model/Tensordot_4/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "swa_model/cond_24/transpose/perm", "op": "Const", "input": ["^swa_model/cond_24/switch_t"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "swa_model/cond_26/ReverseV2/axis", "op": "Const", "input": ["^swa_model/cond_26/switch_t"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "swa_model/cond_25/ReverseV2/axis", "op": "Const", "input": ["^swa_model/cond_25/switch_t"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_1/Prod_1", "op": "Prod", "input": ["swa_model/Tensordot_1/GatherV2_1", "swa_model/strided_slice_9/stack"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "swa_model/Tensordot_1/Prod", "op": "Prod", "input": ["swa_model/Tensordot_1/GatherV2", "swa_model/strided_slice_9/stack"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "swa_model/cond/ReverseV2", "op": "ReverseV2", "input": ["swa_model/cond/Switch_1:1", "swa_model/cond_25/ReverseV2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_1/stack", "op": "Pack", "input": ["swa_model/Tensordot_1/Prod", "swa_model/Tensordot_1/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "swa_model/cond/Merge", "op": "Merge", "input": ["swa_model/cond/Switch_1", "swa_model/cond/ReverseV2"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_1/Reshape", "op": "Reshape", "input": ["swa_model/mul", "swa_model/Tensordot_1/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_1/Switch_1", "op": "Switch", "input": ["swa_model/cond/Merge", "swa_model/strided_slice_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_1/MatMul", "op": "MatMul", "input": ["swa_model/Tensordot_1/Reshape", "swa_model/Tensordot_1/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "swa_model/cond_1/ReverseV2", "op": "ReverseV2", "input": ["swa_model/cond_1/Switch_1:1", "swa_model/cond_26/ReverseV2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Reshape_4", "op": "Reshape", "input": ["swa_model/Tensordot_1/MatMul", "swa_model/Reshape_4/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "swa_model/cond_1/Merge", "op": "Merge", "input": ["swa_model/cond_1/Switch_1", "swa_model/cond_1/ReverseV2"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "swa_model/cond_2/Switch_1", "op": "Switch", "input": ["swa_model/cond_1/Merge", "swa_model/strided_slice_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_2/transpose", "op": "Transpose", "input": ["swa_model/cond_2/Switch_1:1", "swa_model/cond_24/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "swa_model/cond_2/Merge", "op": "Merge", "input": ["swa_model/cond_2/Switch_1", "swa_model/cond_2/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "swa_model/Reshape_2", "op": "Reshape", "input": ["swa_model/cond_2/Merge", "swa_model/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "swa_model/MatMul", "op": "BatchMatMulV2", "input": ["swa_model/Reshape_2", "swa_model/add"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Reshape_3", "op": "Reshape", "input": ["swa_model/MatMul", "swa_model/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "swa_model/strided_slice_4", "op": "StridedSlice", "input": ["swa_model/Reshape_3", "swa_model/strided_slice_4/stack", "swa_model/strided_slice_4/stack_1", "swa_model/strided_slice_4/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "swa_model/Conv2D", "op": "Conv2D", "input": ["swa_model/Reshape_3", "swa_model/conv1/w"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "swa_model/Sum_1", "op": "Sum", "input": ["swa_model/strided_slice_4", "swa_model/Sum_1/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_20", "op": "Sub", "input": ["swa_model/sub_20/x", "swa_model/strided_slice_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/add_1", "op": "Add", "input": ["swa_model/Conv2D", "swa_model/Reshape_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Sqrt", "op": "Sqrt", "input": ["swa_model/Sum_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/mul_26", "op": "Mul", "input": ["swa_model/mul_26/y", "swa_model/sub_20"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean", "op": "Mean", "input": ["swa_model/add_1", "swa_model/Tensordot_4/free"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "swa_model/Reshape_14", "op": "Reshape", "input": ["swa_model/Sqrt", "swa_model/Reshape_14/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "swa_model/Reshape_10", "op": "Reshape", "input": ["swa_model/Sqrt", "swa_model/Reshape_10/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "swa_model/sub", "op": "SquaredDifference", "input": ["swa_model/Mean", "swa_model/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_3/Switch_1", "op": "Switch", "input": ["swa_model/Mean", "swa_model/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_23", "op": "Sub", "input": ["swa_model/Reshape_14", "swa_model/sub_18/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_18", "op": "Sub", "input": ["swa_model/Reshape_10", "swa_model/sub_18/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_1", "op": "Mean", "input": ["swa_model/sub", "swa_model/Tensordot_4/free"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_3/Merge", "op": "Merge", "input": ["ConstantFolding/swa_model/cond_3/Switch_3-folded-0", "swa_model/cond_3/Switch_1:1"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "swa_model/Square_18", "op": "Square", "input": ["swa_model/sub_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/truediv_3", "op": "Mul", "input": ["swa_model/sub_23", "swa_model/sub_25/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/truediv_2", "op": "Mul", "input": ["swa_model/sub_18", "swa_model/sub_25/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_3/Switch_2", "op": "Switch", "input": ["swa_model/Mean_1", "swa_model/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/truediv_4", "op": "Mul", "input": ["ConstantFolding/swa_model/truediv_4_recip", "swa_model/Square_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_3/Merge_1", "op": "Merge", "input": ["ConstantFolding/swa_model/cond_3/Switch_4-folded-0", "swa_model/cond_3/Switch_2:1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_25", "op": "Sub", "input": ["swa_model/truediv_4", "swa_model/sub_25/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm/sub", "op": "Const", "input": ["^swa_model/cond_3/Merge", "^swa_model/cond_3/Merge_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm/Rsqrt", "op": "Const", "input": ["^swa_model/cond_3/Merge_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm/mul", "op": "Mul", "input": ["swa_model/add_1", "swa_model/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm/add_1", "op": "Add", "input": ["swa_model/batchnorm/mul", "swa_model/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu", "op": "Relu", "input": ["swa_model/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Conv2D_1", "op": "Conv2D", "input": ["swa_model/Relu", "swa_model/rconv1/w1"], "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "swa_model/Mean_2", "op": "Mean", "input": ["swa_model/Conv2D_1", "swa_model/Tensordot_4/free"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_1", "op": "SquaredDifference", "input": ["swa_model/Conv2D_1", "swa_model/Mean_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_4/Switch_1", "op": "Switch", "input": ["swa_model/Mean_2", "swa_model/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_3", "op": "Mean", "input": ["swa_model/sub_1", "swa_model/Tensordot_4/free"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_4/Merge", "op": "Merge", "input": ["ConstantFolding/swa_model/cond_4/Switch_3-folded-0", "swa_model/cond_4/Switch_1:1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_4/Switch_2", "op": "Switch", "input": ["swa_model/Mean_3", "swa_model/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_4/Merge_1", "op": "Merge", "input": ["ConstantFolding/swa_model/cond_4/Switch_4-folded-0", "swa_model/cond_4/Switch_2:1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_1/sub", "op": "Const", "input": ["^swa_model/cond_4/Merge", "^swa_model/cond_4/Merge_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_1/Rsqrt", "op": "Const", "input": ["^swa_model/cond_4/Merge_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "swa_model/batchnorm_1/mul", "op": "Mul", "input": ["swa_model/Conv2D_1", "swa_model/batchnorm_1/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_1/add_1", "op": "Add", "input": ["swa_model/batchnorm_1/mul", "swa_model/batchnorm_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_1", "op": "Relu", "input": ["swa_model/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Conv2D_2", "op": "Conv2D", "input": ["swa_model/Relu_1", "swa_model/rconv1/w2"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "swa_model/add_2", "op": "Add", "input": ["swa_model/Conv2D_2", "swa_model/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_4", "op": "Mean", "input": ["swa_model/add_2", "swa_model/Tensordot_4/free"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_2", "op": "SquaredDifference", "input": ["swa_model/Mean_4", "swa_model/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_5/Switch_1", "op": "Switch", "input": ["swa_model/Mean_4", "swa_model/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_5", "op": "Mean", "input": ["swa_model/sub_2", "swa_model/Tensordot_4/free"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "swa_model/cond_5/Merge", "op": "Merge", "input": ["ConstantFolding/swa_model/cond_5/Switch_3-folded-0", "swa_model/cond_5/Switch_1:1"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "swa_model/cond_5/Switch_2", "op": "Switch", "input": ["swa_model/Mean_5", "swa_model/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_5/Merge_1", "op": "Merge", "input": ["ConstantFolding/swa_model/cond_5/Switch_4-folded-0", "swa_model/cond_5/Switch_2:1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_2/sub", "op": "Const", "input": ["^swa_model/cond_5/Merge", "^swa_model/cond_5/Merge_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "swa_model/batchnorm_2/Rsqrt", "op": "Const", "input": ["^swa_model/cond_5/Merge_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_2/mul", "op": "Mul", "input": ["swa_model/add_2", "swa_model/batchnorm_2/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_2/add_1", "op": "Add", "input": ["swa_model/batchnorm_2/mul", "swa_model/batchnorm_2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_2", "op": "Relu", "input": ["swa_model/batchnorm_2/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Conv2D_3", "op": "Conv2D", "input": ["swa_model/Relu_2", "swa_model/rconv2/w1"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_6", "op": "Mean", "input": ["swa_model/Conv2D_3", "swa_model/Tensordot_4/free"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "swa_model/sub_3", "op": "SquaredDifference", "input": ["swa_model/Conv2D_3", "swa_model/Mean_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_6/Switch_1", "op": "Switch", "input": ["swa_model/Mean_6", "swa_model/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_7", "op": "Mean", "input": ["swa_model/sub_3", "swa_model/Tensordot_4/free"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "swa_model/cond_6/Merge", "op": "Merge", "input": ["ConstantFolding/swa_model/cond_6/Switch_3-folded-0", "swa_model/cond_6/Switch_1:1"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "swa_model/cond_6/Switch_2", "op": "Switch", "input": ["swa_model/Mean_7", "swa_model/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_6/Merge_1", "op": "Merge", "input": ["ConstantFolding/swa_model/cond_6/Switch_4-folded-0", "swa_model/cond_6/Switch_2:1"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "swa_model/batchnorm_3/sub", "op": "Const", "input": ["^swa_model/cond_6/Merge", "^swa_model/cond_6/Merge_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_3/Rsqrt", "op": "Const", "input": ["^swa_model/cond_6/Merge_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_3/mul", "op": "Mul", "input": ["swa_model/Conv2D_3", "swa_model/batchnorm_3/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_3/add_1", "op": "Add", "input": ["swa_model/batchnorm_3/mul", "swa_model/batchnorm_3/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_3", "op": "Relu", "input": ["swa_model/batchnorm_3/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Conv2D_4", "op": "Conv2D", "input": ["swa_model/Relu_3", "swa_model/rconv2/w2"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "swa_model/add_3", "op": "Add", "input": ["swa_model/Conv2D_4", "swa_model/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_8", "op": "Mean", "input": ["swa_model/add_3", "swa_model/Tensordot_4/free"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_4", "op": "SquaredDifference", "input": ["swa_model/Mean_8", "swa_model/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_7/Switch_1", "op": "Switch", "input": ["swa_model/Mean_8", "swa_model/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_9", "op": "Mean", "input": ["swa_model/sub_4", "swa_model/Tensordot_4/free"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "swa_model/cond_7/Merge", "op": "Merge", "input": ["ConstantFolding/swa_model/cond_7/Switch_3-folded-0", "swa_model/cond_7/Switch_1:1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_7/Switch_2", "op": "Switch", "input": ["swa_model/Mean_9", "swa_model/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_7/Merge_1", "op": "Merge", "input": ["ConstantFolding/swa_model/cond_7/Switch_4-folded-0", "swa_model/cond_7/Switch_2:1"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "swa_model/batchnorm_4/sub", "op": "Const", "input": ["^swa_model/cond_7/Merge", "^swa_model/cond_7/Merge_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "swa_model/batchnorm_4/Rsqrt", "op": "Const", "input": ["^swa_model/cond_7/Merge_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_4/mul", "op": "Mul", "input": ["swa_model/add_3", "swa_model/batchnorm_4/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_4/add_1", "op": "Add", "input": ["swa_model/batchnorm_4/mul", "swa_model/batchnorm_4/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_4", "op": "Relu", "input": ["swa_model/batchnorm_4/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Conv2D_6", "op": "Conv2D", "input": ["swa_model/Relu_4", "swa_model/rconv3/w1b"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "swa_model/Conv2D_5", "op": "Conv2D", "input": ["swa_model/Relu_4", "swa_model/rconv3/w1a"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "swa_model/Mean_10", "op": "Mean", "input": ["swa_model/Conv2D_6", "swa_model/Tensordot_4/free"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_5", "op": "SquaredDifference", "input": ["swa_model/Conv2D_6", "swa_model/Mean_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_8/Switch_1", "op": "Switch", "input": ["swa_model/Mean_10", "swa_model/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_11", "op": "Mean", "input": ["swa_model/sub_5", "swa_model/Tensordot_4/free"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_8/Merge", "op": "Merge", "input": ["ConstantFolding/swa_model/cond_8/Switch_3-folded-0", "swa_model/cond_8/Switch_1:1"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "swa_model/cond_8/Switch_2", "op": "Switch", "input": ["swa_model/Mean_11", "swa_model/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_8/Merge_1", "op": "Merge", "input": ["ConstantFolding/swa_model/cond_8/Switch_4-folded-0", "swa_model/cond_8/Switch_2:1"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "swa_model/batchnorm_5/sub", "op": "Const", "input": ["^swa_model/cond_8/Merge", "^swa_model/cond_8/Merge_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_5/Rsqrt", "op": "Const", "input": ["^swa_model/cond_8/Merge_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_5/mul", "op": "Mul", "input": ["swa_model/Conv2D_6", "swa_model/batchnorm_5/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/batchnorm_5/add_1", "op": "Add", "input": ["swa_model/batchnorm_5/mul", "swa_model/batchnorm_5/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_5", "op": "Relu", "input": ["swa_model/batchnorm_5/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Max", "op": "Max", "input": ["swa_model/Relu_5", "swa_model/Mean_34/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_12", "op": "Mean", "input": ["swa_model/Relu_5", "swa_model/Mean_34/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "swa_model/mul_9", "op": "Mul", "input": ["swa_model/Mean_12", "swa_model/truediv_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/concat", "op": "ConcatV2", "input": ["swa_model/Mean_12", "swa_model/mul_9", "swa_model/Max", "swa_model/concat_2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_2/Shape", "op": "Shape", "input": ["swa_model/concat"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_2/GatherV2", "op": "GatherV2", "input": ["swa_model/Tensordot_2/Shape", "swa_model/Tensordot_4/free", "swa_model/Tensordot_4/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_2/GatherV2_1", "op": "GatherV2", "input": ["swa_model/Tensordot_2/Shape", "swa_model/strided_slice_11/stack_1", "swa_model/Tensordot_4/GatherV2_1/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_2/concat_1", "op": "ConcatV2", "input": ["swa_model/Tensordot_2/GatherV2", "swa_model/Tensordot_2/Const_2", "swa_model/Tensordot_4/GatherV2_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "swa_model/Tensordot_2/Prod", "op": "Prod", "input": ["swa_model/Tensordot_2/GatherV2", "swa_model/strided_slice_9/stack"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_2/Prod_1", "op": "Prod", "input": ["swa_model/Tensordot_2/GatherV2_1", "swa_model/strided_slice_9/stack"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "swa_model/Tensordot_2/stack", "op": "Pack", "input": ["swa_model/Tensordot_2/Prod", "swa_model/Tensordot_2/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "swa_model/Tensordot_2/Reshape", "op": "Reshape", "input": ["swa_model/concat", "swa_model/Tensordot_2/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_2/MatMul", "op": "MatMul", "input": ["swa_model/Tensordot_2/Reshape", "swa_model/Tensordot_2/Reshape_1"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_2", "op": "Reshape", "input": ["swa_model/Tensordot_2/MatMul", "swa_model/Tensordot_2/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "swa_model/add_4", "op": "Add", "input": ["swa_model/Conv2D_5", "swa_model/Tensordot_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_13", "op": "Mean", "input": ["swa_model/add_4", "swa_model/Tensordot_4/free"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_7", "op": "SquaredDifference", "input": ["swa_model/Mean_13", "swa_model/add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_9/Switch_1", "op": "Switch", "input": ["swa_model/Mean_13", "swa_model/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_14", "op": "Mean", "input": ["swa_model/sub_7", "swa_model/Tensordot_4/free"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_9/Merge", "op": "Merge", "input": ["ConstantFolding/swa_model/cond_9/Switch_3-folded-0", "swa_model/cond_9/Switch_1:1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, 